Revit 2027 API
BuiltInFailures.ScheduleViewFailures.CustomFieldNecessaryIdDeleted Property
 An element that is needed to compute the field [field name] from [schedule name] schedule was deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CustomFieldNecessaryIdDeleted { get; }
Public Shared ReadOnly Property CustomFieldNecessaryIdDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CustomFieldNecessaryIdDeleted {
	FailureDefinitionId^ get ();
}
static member CustomFieldNecessaryIdDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ScheduleViewFailures Class
Autodesk.Revit.DB Namespace